Pandas Series is a NumPy array with extra features

In [429]:
import numpy as np
import pandas as pd

In [430]:
sales=[0,5,155,0,518,1827,616,317,325]

In [431]:
sales_series=pd.Series(sales,name="Sales")
sales_series

0       0
1       5
2     155
3       0
4     518
5    1827
6     616
7     317
8     325
Name: Sales, dtype: int64

In [432]:
array=np.arange(5)
series=pd.Series(array,name="Test Array")
series

0    0
1    1
2    2
3    3
4    4
Name: Test Array, dtype: int32

In [433]:
series.values.mean()

2.0

In [434]:
series.mean()

2.0

In [435]:
series.index

RangeIndex(start=0, stop=5, step=1)

In [436]:
series.index=[10,20,30,40,50]

In [437]:
series

10    0
20    1
30    2
40    3
50    4
Name: Test Array, dtype: int32

In [438]:
series.name="Nahhh"
series

10    0
20    1
30    2
40    3
50    4
Name: Nahhh, dtype: int32

In [439]:
sales_series.astype("float")

0       0.0
1       5.0
2     155.0
3       0.0
4     518.0
5    1827.0
6     616.0
7     317.0
8     325.0
Name: Sales, dtype: float64

In [440]:
sales_series.astype("string")

0       0
1       5
2     155
3       0
4     518
5    1827
6     616
7     317
8     325
Name: Sales, dtype: string

In [441]:
sales_series.astype("int")

0       0
1       5
2     155
3       0
4     518
5    1827
6     616
7     317
8     325
Name: Sales, dtype: int32

In [442]:
sales_series.mean()

418.1111111111111

In [443]:
sales_series.median()

317.0

In [444]:
items=["Coffee","Latte","Ice","Tea","Juice","Candy","Drinks","Chips","Ketchup"]

In [445]:
sales_series.index=items
sales_series

Coffee        0
Latte         5
Ice         155
Tea           0
Juice       518
Candy      1827
Drinks      616
Chips       317
Ketchup     325
Name: Sales, dtype: int64

In [446]:
sales_series["Candy":"Chips"]

Candy     1827
Drinks     616
Chips      317
Name: Sales, dtype: int64

In [447]:
sales_series.index=range(9)

In [448]:
sales_series

0       0
1       5
2     155
3       0
4     518
5    1827
6     616
7     317
8     325
Name: Sales, dtype: int64

In [449]:
sales_series.iloc[[1,2,7]]

1      5
2    155
7    317
Name: Sales, dtype: int64

In [450]:
sales_series.index=["Coffee","Latte","Ice","Tea","Juice","Candy","Drinks","Chips","Ketchup"]

In [451]:
sales_series.loc["Latte":"Juice"]

Latte      5
Ice      155
Tea        0
Juice    518
Name: Sales, dtype: int64

In [452]:
sales_series.reset_index(drop=True)
sales_series

Coffee        0
Latte         5
Ice         155
Tea           0
Juice       518
Candy      1827
Drinks      616
Chips       317
Ketchup     325
Name: Sales, dtype: int64

In [453]:
team=pd.DataFrame({"Name":["Nafeax","Nexy","Lingesh","Pewdiepie"],"Age":[19,19,19,19]})
team

        Name  Age
0     Nafeax   19
1       Nexy   19
2    Lingesh   19
3  Pewdiepie   19

In [454]:
team.iloc[2:,:]

        Name  Age
2    Lingesh   19
3  Pewdiepie   19

In [455]:
team.loc[2:,"Name"]

2      Lingesh
3    Pewdiepie
Name: Name, dtype: object

In [456]:
sales_series.loc[sales_series>0]

Latte         5
Ice         155
Juice       518
Candy      1827
Drinks      616
Chips       317
Ketchup     325
Name: Sales, dtype: int64

In [457]:
sales_series.eq(0)

Coffee      True
Latte      False
Ice        False
Tea         True
Juice      False
Candy      False
Drinks     False
Chips      False
Ketchup    False
Name: Sales, dtype: bool

In [458]:
sales_series.gt(1000)

Coffee     False
Latte      False
Ice        False
Tea        False
Juice      False
Candy       True
Drinks     False
Chips      False
Ketchup    False
Name: Sales, dtype: bool

In [459]:
sales_series.isin([5])

Coffee     False
Latte       True
Ice        False
Tea        False
Juice      False
Candy      False
Drinks     False
Chips      False
Ketchup    False
Name: Sales, dtype: bool

In [460]:
sales_series.sort_values()

Coffee        0
Tea           0
Latte         5
Ice         155
Chips       317
Ketchup     325
Juice       518
Drinks      616
Candy      1827
Name: Sales, dtype: int64

In [461]:
sales_series.sort_values(ascending=False)

Candy      1827
Drinks      616
Juice       518
Ketchup     325
Chips       317
Ice         155
Latte         5
Coffee        0
Tea           0
Name: Sales, dtype: int64

In [462]:
sales_series.isin([1,2])

Coffee     False
Latte      False
Ice        False
Tea        False
Juice      False
Candy      False
Drinks     False
Chips      False
Ketchup    False
Name: Sales, dtype: bool

In [463]:
transaction=pd.read_csv("transactions.csv")
transaction_series=pd.Series(transaction["transactions"])
transaction_series.head()

0     770
1    2111
2    2358
3    3487
4    1922
Name: transactions, dtype: int64

In [464]:
transaction_series.quantile([0.25,0.50,0.75,0.95,0.99],interpolation="nearest")

0.25    1046
0.50    1393
0.75    2079
0.95    3712
0.99    4862
Name: transactions, dtype: int64

In [465]:
transaction_series.max()

8359

In [466]:
sales_series

Coffee        0
Latte         5
Ice         155
Tea           0
Juice       518
Candy      1827
Drinks      616
Chips       317
Ketchup     325
Name: Sales, dtype: int64

In [467]:
sales_series.unique()

array([   0,    5,  155,  518, 1827,  616,  317,  325], dtype=int64)

In [468]:
sales_series.nunique()

8

In [469]:
sales_series.value_counts(normalize=True)

0       0.222222
5       0.111111
155     0.111111
518     0.111111
1827    0.111111
616     0.111111
317     0.111111
325     0.111111
Name: Sales, dtype: float64

In [470]:
sales=[1,90,2,45,78,np.nan,89]
sales1=pd.Series(sales,name="Sales")
sales1

0     1.0
1    90.0
2     2.0
3    45.0
4    78.0
5     NaN
6    89.0
Name: Sales, dtype: float64

In [471]:
sales1.isna()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
Name: Sales, dtype: bool

In [472]:
sales1.value_counts(dropna=False)

1.0     1
90.0    1
2.0     1
45.0    1
78.0    1
NaN     1
89.0    1
Name: Sales, dtype: int64

In [473]:
sales1.dropna(inplace=True)
sales1.reset_index(drop=True)

0     1.0
1    90.0
2     2.0
3    45.0
4    78.0
5    89.0
Name: Sales, dtype: float64

In [474]:
def fuc(price):
    if price>50:
        return round(price*0.80,2)
    else:
        return price

In [475]:
sales1.apply(lambda x: round(x*0.80) if x>50 else x)

0     1.0
1    72.0
2     2.0
3    45.0
4    62.0
6    71.0
Name: Sales, dtype: float64

In [476]:
pd.DataFrame({"ID":[1,2],"Name":["Lingesh","Pewdiepie"]})

   ID       Name
0   1    Lingesh
1   2  Pewdiepie

In [477]:
df=pd.read_csv("transactions.csv")
df.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [478]:
df.tail()

             date  store_nbr  transactions
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

In [479]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [480]:
df.sample(5)

             date  store_nbr  transactions
32761  2014-12-04         12          1188
38084  2015-03-26          7          1585
37585  2015-03-16          4          1318
42243  2015-06-18         28          1052
11962  2013-09-16         41           794

In [481]:
df.describe(include="all")

              date     store_nbr  transactions
count        83488  83488.000000  83488.000000
unique        1682           NaN           NaN
top     2017-08-15           NaN           NaN
freq            54           NaN           NaN
mean           NaN     26.939237   1694.602158
std            NaN     15.608204    963.286644
min            NaN      1.000000      5.000000
25%            NaN     13.000000   1046.000000
50%            NaN     27.000000   1393.000000
75%            NaN     40.000000   2079.000000
max            NaN     54.000000   8359.000000

In [482]:
df[["date","store_nbr"]]

             date  store_nbr
0      2013-01-01         25
1      2013-01-02          1
2      2013-01-02          2
3      2013-01-02          3
4      2013-01-02          4
...           ...        ...
83483  2017-08-15         50
83484  2017-08-15         51
83485  2017-08-15         52
83486  2017-08-15         53
83487  2017-08-15         54

[83488 rows x 2 columns]

In [483]:
df.store_nbr

0        25
1         1
2         2
3         3
4         4
         ..
83483    50
83484    51
83485    52
83486    53
83487    54
Name: store_nbr, Length: 83488, dtype: int64

In [484]:
df["date"].nunique()

1682

In [485]:
df["date"].value_counts()

2017-08-15    54
2017-06-02    54
2017-05-21    54
2017-05-22    54
2017-05-23    54
              ..
2016-01-04    14
2014-01-01     2
2017-01-01     1
2015-01-01     1
2013-01-01     1
Name: date, Length: 1682, dtype: int64

In [486]:
df.columns

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [487]:
df.columns=["Date","Store","Transactions"]

In [488]:
df.columns

Index(['Date', 'Store', 'Transactions'], dtype='object')

In [489]:
df.iloc[3:,:2]

             Date  Store
3      2013-01-02      3
4      2013-01-02      4
5      2013-01-02      5
6      2013-01-02      6
7      2013-01-02      7
...           ...    ...
83483  2017-08-15     50
83484  2017-08-15     51
83485  2017-08-15     52
83486  2017-08-15     53
83487  2017-08-15     54

[83485 rows x 2 columns]

In [490]:
df.loc[5:,["Date","Transactions"]]

             Date  Transactions
5      2013-01-02          1903
6      2013-01-02          2143
7      2013-01-02          1874
8      2013-01-02          3250
9      2013-01-02          2940
...           ...           ...
83483  2017-08-15          2804
83484  2017-08-15          1573
83485  2017-08-15          2255
83486  2017-08-15           932
83487  2017-08-15           802

[83483 rows x 2 columns]

In [491]:
df.head()

         Date  Store  Transactions
0  2013-01-01     25           770
1  2013-01-02      1          2111
2  2013-01-02      2          2358
3  2013-01-02      3          3487
4  2013-01-02      4          1922

In [492]:
df.loc[:,["Store","Transactions"]]

       Store  Transactions
0         25           770
1          1          2111
2          2          2358
3          3          3487
4          4          1922
...      ...           ...
83483     50          2804
83484     51          1573
83485     52          2255
83486     53           932
83487     54           802

[83488 rows x 2 columns]

In [493]:
df.loc[:,["Store","Transactions"]].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         83488 non-null  int64
 1   Transactions  83488 non-null  int64
dtypes: int64(2)
memory usage: 1.3 MB

In [494]:
df.drop("Date",axis=1).head()

   Store  Transactions
0     25           770
1      1          2111
2      2          2358
3      3          3487
4      4          1922

In [495]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          83488 non-null  object
 1   Store         83488 non-null  int64
 2   Transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [496]:
df.drop(range(1,100,2),axis=0).head()

         Date  Store  Transactions
0  2013-01-01     25           770
2  2013-01-02      2          2358
4  2013-01-02      4          1922
6  2013-01-02      6          2143
8  2013-01-02      8          3250

In [497]:
df.duplicated(subset="Date").value_counts()

True     81806
False     1682
dtype: int64

In [498]:
df.drop_duplicates(subset="Date")

             Date  Store  Transactions
0      2013-01-01     25           770
1      2013-01-02      1          2111
47     2013-01-03      1          1833
93     2013-01-04      1          1863
139    2013-01-05      1          1509
...           ...    ...           ...
83218  2017-08-11      1           570
83272  2017-08-12      1          1004
83326  2017-08-13      1           416
83380  2017-08-14      1          1733
83434  2017-08-15      1          1693

[1682 rows x 3 columns]

In [499]:
df.drop_duplicates(subset="Date",keep="last",ignore_index=True)

            Date  Store  Transactions
0     2013-01-01     25           770
1     2013-01-02     54           998
2     2013-01-03     54           920
3     2013-01-04     54           794
4     2013-01-05     54           949
...          ...    ...           ...
1677  2017-08-11     54           768
1678  2017-08-12     54           903
1679  2017-08-13     54          1054
1680  2017-08-14     54           818
1681  2017-08-15     54           802

[1682 rows x 3 columns]

In [500]:
df.drop_duplicates(subset="Date",keep="last",ignore_index=True)

            Date  Store  Transactions
0     2013-01-01     25           770
1     2013-01-02     54           998
2     2013-01-03     54           920
3     2013-01-04     54           794
4     2013-01-05     54           949
...          ...    ...           ...
1677  2017-08-11     54           768
1678  2017-08-12     54           903
1679  2017-08-13     54          1054
1680  2017-08-14     54           818
1681  2017-08-15     54           802

[1682 rows x 3 columns]

In [501]:
df.isna().sum()

Date            0
Store           0
Transactions    0
dtype: int64

In [502]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          83488 non-null  object
 1   Store         83488 non-null  int64
 2   Transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [503]:
df.describe()

              Store  Transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000

In [504]:
mask=df["Store"].isin([28,29,30]) | df["Store"].lt(5)
mask

0        False
1         True
2         True
3         True
4         True
         ...
83483    False
83484    False
83485    False
83486    False
83487    False
Name: Store, Length: 83488, dtype: bool

In [505]:
df[mask]

             Date  Store  Transactions
1      2013-01-02      1          2111
2      2013-01-02      2          2358
3      2013-01-02      3          3487
4      2013-01-02      4          1922
25     2013-01-02     28           950
...           ...    ...           ...
83436  2017-08-15      3          2956
83437  2017-08-15      4          1283
83461  2017-08-15     28          1343
83462  2017-08-15     29          1302
83463  2017-08-15     30           825

[10911 rows x 3 columns]

In [506]:
num=5
df.query("Store in [28,29,30] or Store<@num")

             Date  Store  Transactions
1      2013-01-02      1          2111
2      2013-01-02      2          2358
3      2013-01-02      3          3487
4      2013-01-02      4          1922
25     2013-01-02     28           950
...           ...    ...           ...
83436  2017-08-15      3          2956
83437  2017-08-15      4          1283
83461  2017-08-15     28          1343
83462  2017-08-15     29          1302
83463  2017-08-15     30           825

[10911 rows x 3 columns]

In [507]:
df.sort_values("Store")

             Date  Store  Transactions
42968  2015-07-03      1          2012
11033  2013-08-28      1          1831
81328  2017-07-07      1          1843
73300  2017-02-07      1          1887
2347   2013-02-22      1          1805
...           ...    ...           ...
50112  2015-11-17     54           744
78033  2017-05-06     54           840
17002  2014-01-03     54           798
20949  2014-03-28     54           839
83487  2017-08-15     54           802

[83488 rows x 3 columns]

In [508]:
df.sort_index(axis=0)

             Date  Store  Transactions
0      2013-01-01     25           770
1      2013-01-02      1          2111
2      2013-01-02      2          2358
3      2013-01-02      3          3487
4      2013-01-02      4          1922
...           ...    ...           ...
83483  2017-08-15     50          2804
83484  2017-08-15     51          1573
83485  2017-08-15     52          2255
83486  2017-08-15     53           932
83487  2017-08-15     54           802

[83488 rows x 3 columns]

In [509]:
df.sort_index(axis=1)

             Date  Store  Transactions
0      2013-01-01     25           770
1      2013-01-02      1          2111
2      2013-01-02      2          2358
3      2013-01-02      3          3487
4      2013-01-02      4          1922
...           ...    ...           ...
83483  2017-08-15     50          2804
83484  2017-08-15     51          1573
83485  2017-08-15     52          2255
83486  2017-08-15     53           932
83487  2017-08-15     54           802

[83488 rows x 3 columns]

In [560]:
oil=pd.read_csv("oil.csv")
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [561]:
oil.dropna(inplace=True)

In [562]:
oil

            date  dcoilwtico
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
5     2013-01-08       93.21
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1175 rows x 2 columns]

In [563]:
oil.isna().sum()

date          0
dcoilwtico    0
dtype: int64

In [564]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1175 entries, 1 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1175 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 27.5+ KB

In [565]:
oil_new=pd.read_csv("oil.csv",parse_dates=["date"])

In [566]:
oil_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   datetime64[ns]
 1   dcoilwtico  1175 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 19.2 KB

In [567]:
oil

            date  dcoilwtico
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
5     2013-01-08       93.21
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1175 rows x 2 columns]

In [568]:
oil["Month"]=oil["date"].astype("datetime64").dt.month

In [569]:
oil.sort_values(["Month","dcoilwtico"],ascending=[True,False])

           date  dcoilwtico  Month
282  2014-01-30       98.25      1
21   2013-01-30       97.98      1
22   2013-01-31       97.65      1
20   2013-01-29       97.62      1
283  2014-01-31       97.55      1
..          ...         ...    ...
768  2015-12-11       35.65     12
771  2015-12-16       35.55     12
772  2015-12-17       34.98     12
773  2015-12-18       34.72     12
774  2015-12-21       34.55     12

[1175 rows x 3 columns]

In [570]:
oil=oil.iloc[:5,:]
oil

         date  dcoilwtico  Month
1  2013-01-02       93.14      1
2  2013-01-03       92.97      1
3  2013-01-04       93.12      1
4  2013-01-07       93.20      1
5  2013-01-08       93.21      1

In [571]:
oil.columns.values

array(['date', 'dcoilwtico', 'Month'], dtype=object)

In [572]:
oil.columns=[col.capitalize() for col in oil.columns.values]

In [573]:
oil

         Date  Dcoilwtico  Month
1  2013-01-02       93.14      1
2  2013-01-03       92.97      1
3  2013-01-04       93.12      1
4  2013-01-07       93.20      1
5  2013-01-08       93.21      1

In [574]:
oil.rename(columns={"Date":"DaTe","Dcoilwtico":"WTF is this","Month":"Maadham"},inplace=True)

C:\Users\Magesh\AppData\Roaming\Python\Python310\site-packages\pandas\core\frame.py:5039: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [575]:
oil

         DaTe  WTF is this  Maadham
1  2013-01-02        93.14        1
2  2013-01-03        92.97        1
3  2013-01-04        93.12        1
4  2013-01-07        93.20        1
5  2013-01-08        93.21        1

In [576]:
oil.reindex(labels=["WTF is this","Maadham","DaTe"],axis=1)

   WTF is this  Maadham        DaTe
1        93.14        1  2013-01-02
2        92.97        1  2013-01-03
3        93.12        1  2013-01-04
4        93.20        1  2013-01-07
5        93.21        1  2013-01-08

In [577]:
oil=oil[["WTF is this","DaTe"]]

In [578]:
oil=oil.rename(columns={"WTF is this":"Price","DaTe":"Date"})
oil.head()

   Price        Date
1  93.14  2013-01-02
2  92.97  2013-01-03
3  93.12  2013-01-04
4  93.20  2013-01-07
5  93.21  2013-01-08

In [579]:
conditions=[(oil["Price"]>93),(oil["Price"]<93)]
choices=["Yes","No"]
oil["Yes/No"]=np.select(conditions,choices,default=np.nan)

In [580]:
oil["Yes/No"].value_counts()

Yes    4
No     1
Name: Yes/No, dtype: int64

In [581]:
oil["Yes/No"]=oil["Yes/No"].map({"Yes":1,"No":0})
oil

   Price        Date  Yes/No
1  93.14  2013-01-02       1
2  92.97  2013-01-03       0
3  93.12  2013-01-04       1
4  93.20  2013-01-07       1
5  93.21  2013-01-08       1

In [582]:
oil["Yes/No"]=oil["Yes/No"].map(lambda x: "True" if x==1 else "False")
oil

   Price        Date Yes/No
1  93.14  2013-01-02   True
2  92.97  2013-01-03  False
3  93.12  2013-01-04   True
4  93.20  2013-01-07   True
5  93.21  2013-01-08   True